/*
 * Задача : 
 * Ввести натуральное трехзначное число Р. 
 * Найти наибольшее целое число, которое можно получить, переставляя цифры числа Р.
 * 
 * Формат входных данных : 
 * -------test_1-------
 * 208
 * -------test_2-------
 * 159
 * --------------------
 * 
 * Формат выходных данных : 
 * -------test_1-------
 * 820
 * -------test_2-------
 * 951
 * --------------------
 */

using System;

namespace Task_02 {
	class Program {
		static void Main(string[] args) {
			int p;
			// TODO : Реализовать ввод целочисленного значения.
			p =;

			// TODO : Посчиать и вывести результат.
		}

		static int MaxPermutation(int x) {
			// TODO : Получить цифры числа используя арифметические операции.
			int firstDigit = ,
				secondDigit = ,
				thirdDigit = ;

			// TODO : Собрать новое число и вернуть его. 
			int max =
			return max;
		}
	}
}
